tutorials/Aerostructural/Rotor67/runFluid/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object snappyHexMeshDict;
}

    castellatedMesh true;
    snap true;
    addLayers false;
    geometry
    {
        blade.stl
        {
            type triSurfaceMesh;
            name blade;

            regions
            {
                bladeps {name bladeps;}
                bladess {name bladess; }
                bladetip {name bladetip; }
                hub {name hub; }
                hubbot {name hubbot; }
                hubside1 {name hubside1; }
                hubside2 {name hubside2;}
                fillet {name fillet;}
            }
        }
    }

    castellatedMeshControls
    {
        features
        (

        );
        refinementSurfaces
        {
            bladeps
            {
                level ( 7 7);
            }
            bladess
            {
                level ( 7 7 );
            }
            bladetip
            {
                level ( 7 7 );
            }
            fillet
            {
                level ( 7 7 );
            }
            hub
            {
                level ( 7 7 );
            }
            hubbot
            {
                level ( 7 7 );
            }
            hubside1
            {
                level ( 7 7 );
                patchInfo
                {
                    type cyclic;
                }
            }
            hubside2
            {
                level ( 7 7 );
                patchInfo
                {
                    type cyclic;
                }
            }
            
        }

        refinementRegions
        {
           
        }

        locationInMesh ( 0.103 -0.013 0.0255 );
        maxLocalCells 100000;
        maxGlobalCells 2000000;
        minRefinementCells 0;
        nCellsBetweenLevels 3;
        resolveFeatureAngle 10;
        allowFreeStandingZoneFaces true;
        planarAngle 30;
        maxLoadUnbalance 0.10;
    }

    snapControls
    {
        nSolveIter 50;
        nSmoothPatch 3;
        tolerance 2.0;
        nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap false;
    }

    addLayersControls
    {
        layers
        {
            "body.*"
            {nSurfaceLayers 3;}
        }

        relativeSizes true;
        expansionRatio 1.1;
        finalLayerThickness 0.9;
        minThickness 0.001;
        nGrow 0;
        featureAngle 270;
        slipFeatureAngle 60;
        nRelaxIter 5;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
        writeVTK false;
        noErrors false;
        layerRecovery 1;
        growZoneLayers false;
        projectGrownUp 0.0;
    }

    meshQualityControls
    {
        maxNonOrtho 60;
        maxBoundarySkewness 10;
        maxInternalSkewness 4;
        maxConcave 80;
        minFlatness 0.5;
        minVol 1.00E-13;
        minTetQuality -1e12;
        minArea -1;
        minTwist 0.05;
        minDeterminant 0.02;
        minFaceWeight 0.05;
        minVolRatio 0.01;
        minTriangleTwist -1;
        nSmoothScale 4;
        errorReduction 0.75;
    }

    debug 0;
    mergeTolerance 1E-6;
    autoBlockMesh false;
