tutorials/Aerostructural/Rotor67/runFluid/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    bladeps
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    bladess
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    bladefillet
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    hub
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    shroud
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    per1
    {
        type            cyclic;
    }
    per2
    {
        type            cyclic;
    }
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
